In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({"employees": ["Jeff", "Amanda", "Robert"], "group": ["Engineering", "HR", "Engineering"]})

In [5]:
df1

  employees        group
0      Jeff  Engineering
1    Amanda           HR
2    Robert  Engineering

In [8]:
df2 = pd.DataFrame({"employees": ["Jeff", "Amanda", "Robert"], "date": [2010, 2009, 2019]})

In [9]:
df2

  employees  date
0      Jeff  2010
1    Amanda  2009
2    Robert  2019

In [10]:
pd.merge(df1, df2)

  employees        group  date
0      Jeff  Engineering  2010
1    Amanda           HR  2009
2    Robert  Engineering  2019

In [11]:
pd.merge(df1, df2, on="employees")

  employees        group  date
0      Jeff  Engineering  2010
1    Amanda           HR  2009
2    Robert  Engineering  2019

In [12]:
df3 = pd.merge(df1, df2)

In [13]:
df3

  employees        group  date
0      Jeff  Engineering  2010
1    Amanda           HR  2009
2    Robert  Engineering  2019

In [18]:
df4 = pd.DataFrame({"group": ["Engineering", "HR"], "manager": ["Sarah", "Joe"]})

In [19]:
df4

         group manager
0  Engineering   Sarah
1           HR     Joe

In [20]:
pd.merge(df3,df4)

  employees        group  date manager
0      Jeff  Engineering  2010   Sarah
1    Amanda           HR  2009     Joe
2    Robert  Engineering  2019   Sarah

In [21]:
df5 = pd.DataFrame({"group": ["Engineering", "HR", "Engineering", "IT"], "skills": ["math", "excel", "coding", "management"]})

In [22]:
df5

         group      skills
0  Engineering        math
1           HR       excel
2  Engineering      coding
3           IT  management

In [23]:
df1

  employees        group
0      Jeff  Engineering
1    Amanda           HR
2    Robert  Engineering

In [24]:
pd.merge(df1, df5)

  employees        group  skills
0      Jeff  Engineering    math
1      Jeff  Engineering  coding
2    Amanda           HR   excel
3    Robert  Engineering    math
4    Robert  Engineering  coding